ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/devices/include/ip/cyip_usbfs.h
#define USBFS_USBDEV_ARB_EP3_CFG_IN_DATA_RDY_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP3_CFG_DMA_REQ_Pos    1UL
#define USBFS_USBDEV_ARB_EP3_CFG_DMA_REQ_Msk    0x2UL
#define USBFS_USBDEV_ARB_EP3_CFG_CRC_BYPASS_Pos 2UL
#define USBFS_USBDEV_ARB_EP3_CFG_CRC_BYPASS_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP3_CFG_RESET_PTR_Pos  3UL
#define USBFS_USBDEV_ARB_EP3_CFG_RESET_PTR_Msk  0x8UL
/* USBFS_USBDEV.ARB_EP3_INT_EN */
#define USBFS_USBDEV_ARB_EP3_INT_EN_IN_BUF_FULL_EN_Pos 0UL
#define USBFS_USBDEV_ARB_EP3_INT_EN_IN_BUF_FULL_EN_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP3_INT_EN_DMA_GNT_EN_Pos 1UL
#define USBFS_USBDEV_ARB_EP3_INT_EN_DMA_GNT_EN_Msk 0x2UL
#define USBFS_USBDEV_ARB_EP3_INT_EN_BUF_OVER_EN_Pos 2UL
#define USBFS_USBDEV_ARB_EP3_INT_EN_BUF_OVER_EN_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP3_INT_EN_BUF_UNDER_EN_Pos 3UL
#define USBFS_USBDEV_ARB_EP3_INT_EN_BUF_UNDER_EN_Msk 0x8UL
#define USBFS_USBDEV_ARB_EP3_INT_EN_ERR_INT_EN_Pos 4UL
#define USBFS_USBDEV_ARB_EP3_INT_EN_ERR_INT_EN_Msk 0x10UL
#define USBFS_USBDEV_ARB_EP3_INT_EN_DMA_TERMIN_EN_Pos 5UL
#define USBFS_USBDEV_ARB_EP3_INT_EN_DMA_TERMIN_EN_Msk 0x20UL
/* USBFS_USBDEV.ARB_EP3_SR */
#define USBFS_USBDEV_ARB_EP3_SR_IN_BUF_FULL_Pos 0UL
#define USBFS_USBDEV_ARB_EP3_SR_IN_BUF_FULL_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP3_SR_DMA_GNT_Pos     1UL
#define USBFS_USBDEV_ARB_EP3_SR_DMA_GNT_Msk     0x2UL
#define USBFS_USBDEV_ARB_EP3_SR_BUF_OVER_Pos    2UL
#define USBFS_USBDEV_ARB_EP3_SR_BUF_OVER_Msk    0x4UL
#define USBFS_USBDEV_ARB_EP3_SR_BUF_UNDER_Pos   3UL
#define USBFS_USBDEV_ARB_EP3_SR_BUF_UNDER_Msk   0x8UL
#define USBFS_USBDEV_ARB_EP3_SR_DMA_TERMIN_Pos  5UL
#define USBFS_USBDEV_ARB_EP3_SR_DMA_TERMIN_Msk  0x20UL
/* USBFS_USBDEV.ARB_RW3_WA */
#define USBFS_USBDEV_ARB_RW3_WA_WA_Pos          0UL
#define USBFS_USBDEV_ARB_RW3_WA_WA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW3_WA_MSB */
#define USBFS_USBDEV_ARB_RW3_WA_MSB_WA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW3_WA_MSB_WA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW3_RA */
#define USBFS_USBDEV_ARB_RW3_RA_RA_Pos          0UL
#define USBFS_USBDEV_ARB_RW3_RA_RA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW3_RA_MSB */
#define USBFS_USBDEV_ARB_RW3_RA_MSB_RA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW3_RA_MSB_RA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW3_DR */
#define USBFS_USBDEV_ARB_RW3_DR_DR_Pos          0UL
#define USBFS_USBDEV_ARB_RW3_DR_DR_Msk          0xFFUL
/* USBFS_USBDEV.CWA */
#define USBFS_USBDEV_CWA_CWA_Pos                0UL
#define USBFS_USBDEV_CWA_CWA_Msk                0xFFUL
/* USBFS_USBDEV.CWA_MSB */
#define USBFS_USBDEV_CWA_MSB_CWA_MSB_Pos        0UL
#define USBFS_USBDEV_CWA_MSB_CWA_MSB_Msk        0x1UL
/* USBFS_USBDEV.ARB_EP4_CFG */
#define USBFS_USBDEV_ARB_EP4_CFG_IN_DATA_RDY_Pos 0UL
#define USBFS_USBDEV_ARB_EP4_CFG_IN_DATA_RDY_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP4_CFG_DMA_REQ_Pos    1UL
#define USBFS_USBDEV_ARB_EP4_CFG_DMA_REQ_Msk    0x2UL
#define USBFS_USBDEV_ARB_EP4_CFG_CRC_BYPASS_Pos 2UL
#define USBFS_USBDEV_ARB_EP4_CFG_CRC_BYPASS_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP4_CFG_RESET_PTR_Pos  3UL
#define USBFS_USBDEV_ARB_EP4_CFG_RESET_PTR_Msk  0x8UL
/* USBFS_USBDEV.ARB_EP4_INT_EN */
#define USBFS_USBDEV_ARB_EP4_INT_EN_IN_BUF_FULL_EN_Pos 0UL
#define USBFS_USBDEV_ARB_EP4_INT_EN_IN_BUF_FULL_EN_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP4_INT_EN_DMA_GNT_EN_Pos 1UL
#define USBFS_USBDEV_ARB_EP4_INT_EN_DMA_GNT_EN_Msk 0x2UL
#define USBFS_USBDEV_ARB_EP4_INT_EN_BUF_OVER_EN_Pos 2UL
#define USBFS_USBDEV_ARB_EP4_INT_EN_BUF_OVER_EN_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP4_INT_EN_BUF_UNDER_EN_Pos 3UL
#define USBFS_USBDEV_ARB_EP4_INT_EN_BUF_UNDER_EN_Msk 0x8UL
#define USBFS_USBDEV_ARB_EP4_INT_EN_ERR_INT_EN_Pos 4UL
#define USBFS_USBDEV_ARB_EP4_INT_EN_ERR_INT_EN_Msk 0x10UL
#define USBFS_USBDEV_ARB_EP4_INT_EN_DMA_TERMIN_EN_Pos 5UL
#define USBFS_USBDEV_ARB_EP4_INT_EN_DMA_TERMIN_EN_Msk 0x20UL
/* USBFS_USBDEV.ARB_EP4_SR */
#define USBFS_USBDEV_ARB_EP4_SR_IN_BUF_FULL_Pos 0UL
#define USBFS_USBDEV_ARB_EP4_SR_IN_BUF_FULL_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP4_SR_DMA_GNT_Pos     1UL
#define USBFS_USBDEV_ARB_EP4_SR_DMA_GNT_Msk     0x2UL
#define USBFS_USBDEV_ARB_EP4_SR_BUF_OVER_Pos    2UL
#define USBFS_USBDEV_ARB_EP4_SR_BUF_OVER_Msk    0x4UL
#define USBFS_USBDEV_ARB_EP4_SR_BUF_UNDER_Pos   3UL
#define USBFS_USBDEV_ARB_EP4_SR_BUF_UNDER_Msk   0x8UL
#define USBFS_USBDEV_ARB_EP4_SR_DMA_TERMIN_Pos  5UL
#define USBFS_USBDEV_ARB_EP4_SR_DMA_TERMIN_Msk  0x20UL
/* USBFS_USBDEV.ARB_RW4_WA */
#define USBFS_USBDEV_ARB_RW4_WA_WA_Pos          0UL
#define USBFS_USBDEV_ARB_RW4_WA_WA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW4_WA_MSB */
#define USBFS_USBDEV_ARB_RW4_WA_MSB_WA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW4_WA_MSB_WA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW4_RA */
#define USBFS_USBDEV_ARB_RW4_RA_RA_Pos          0UL
#define USBFS_USBDEV_ARB_RW4_RA_RA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW4_RA_MSB */
#define USBFS_USBDEV_ARB_RW4_RA_MSB_RA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW4_RA_MSB_RA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW4_DR */
#define USBFS_USBDEV_ARB_RW4_DR_DR_Pos          0UL
#define USBFS_USBDEV_ARB_RW4_DR_DR_Msk          0xFFUL
/* USBFS_USBDEV.DMA_THRES */
#define USBFS_USBDEV_DMA_THRES_DMA_THS_Pos      0UL
#define USBFS_USBDEV_DMA_THRES_DMA_THS_Msk      0xFFUL
/* USBFS_USBDEV.DMA_THRES_MSB */
#define USBFS_USBDEV_DMA_THRES_MSB_DMA_THS_MSB_Pos 0UL
#define USBFS_USBDEV_DMA_THRES_MSB_DMA_THS_MSB_Msk 0x1UL
/* USBFS_USBDEV.ARB_EP5_CFG */
#define USBFS_USBDEV_ARB_EP5_CFG_IN_DATA_RDY_Pos 0UL
#define USBFS_USBDEV_ARB_EP5_CFG_IN_DATA_RDY_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP5_CFG_DMA_REQ_Pos    1UL
#define USBFS_USBDEV_ARB_EP5_CFG_DMA_REQ_Msk    0x2UL
#define USBFS_USBDEV_ARB_EP5_CFG_CRC_BYPASS_Pos 2UL
#define USBFS_USBDEV_ARB_EP5_CFG_CRC_BYPASS_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP5_CFG_RESET_PTR_Pos  3UL
#define USBFS_USBDEV_ARB_EP5_CFG_RESET_PTR_Msk  0x8UL
/* USBFS_USBDEV.ARB_EP5_INT_EN */
#define USBFS_USBDEV_ARB_EP5_INT_EN_IN_BUF_FULL_EN_Pos 0UL
#define USBFS_USBDEV_ARB_EP5_INT_EN_IN_BUF_FULL_EN_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP5_INT_EN_DMA_GNT_EN_Pos 1UL
#define USBFS_USBDEV_ARB_EP5_INT_EN_DMA_GNT_EN_Msk 0x2UL
#define USBFS_USBDEV_ARB_EP5_INT_EN_BUF_OVER_EN_Pos 2UL
#define USBFS_USBDEV_ARB_EP5_INT_EN_BUF_OVER_EN_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP5_INT_EN_BUF_UNDER_EN_Pos 3UL
#define USBFS_USBDEV_ARB_EP5_INT_EN_BUF_UNDER_EN_Msk 0x8UL
#define USBFS_USBDEV_ARB_EP5_INT_EN_ERR_INT_EN_Pos 4UL
#define USBFS_USBDEV_ARB_EP5_INT_EN_ERR_INT_EN_Msk 0x10UL
#define USBFS_USBDEV_ARB_EP5_INT_EN_DMA_TERMIN_EN_Pos 5UL
#define USBFS_USBDEV_ARB_EP5_INT_EN_DMA_TERMIN_EN_Msk 0x20UL
/* USBFS_USBDEV.ARB_EP5_SR */
#define USBFS_USBDEV_ARB_EP5_SR_IN_BUF_FULL_Pos 0UL
#define USBFS_USBDEV_ARB_EP5_SR_IN_BUF_FULL_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP5_SR_DMA_GNT_Pos     1UL
#define USBFS_USBDEV_ARB_EP5_SR_DMA_GNT_Msk     0x2UL
#define USBFS_USBDEV_ARB_EP5_SR_BUF_OVER_Pos    2UL
#define USBFS_USBDEV_ARB_EP5_SR_BUF_OVER_Msk    0x4UL
#define USBFS_USBDEV_ARB_EP5_SR_BUF_UNDER_Pos   3UL
#define USBFS_USBDEV_ARB_EP5_SR_BUF_UNDER_Msk   0x8UL
#define USBFS_USBDEV_ARB_EP5_SR_DMA_TERMIN_Pos  5UL
#define USBFS_USBDEV_ARB_EP5_SR_DMA_TERMIN_Msk  0x20UL
/* USBFS_USBDEV.ARB_RW5_WA */
#define USBFS_USBDEV_ARB_RW5_WA_WA_Pos          0UL
#define USBFS_USBDEV_ARB_RW5_WA_WA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW5_WA_MSB */
#define USBFS_USBDEV_ARB_RW5_WA_MSB_WA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW5_WA_MSB_WA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW5_RA */
#define USBFS_USBDEV_ARB_RW5_RA_RA_Pos          0UL
#define USBFS_USBDEV_ARB_RW5_RA_RA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW5_RA_MSB */
#define USBFS_USBDEV_ARB_RW5_RA_MSB_RA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW5_RA_MSB_RA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW5_DR */
#define USBFS_USBDEV_ARB_RW5_DR_DR_Pos          0UL
#define USBFS_USBDEV_ARB_RW5_DR_DR_Msk          0xFFUL
/* USBFS_USBDEV.BUS_RST_CNT */
#define USBFS_USBDEV_BUS_RST_CNT_BUS_RST_CNT_Pos 0UL
#define USBFS_USBDEV_BUS_RST_CNT_BUS_RST_CNT_Msk 0xFUL
/* USBFS_USBDEV.ARB_EP6_CFG */
#define USBFS_USBDEV_ARB_EP6_CFG_IN_DATA_RDY_Pos 0UL
#define USBFS_USBDEV_ARB_EP6_CFG_IN_DATA_RDY_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP6_CFG_DMA_REQ_Pos    1UL
#define USBFS_USBDEV_ARB_EP6_CFG_DMA_REQ_Msk    0x2UL
#define USBFS_USBDEV_ARB_EP6_CFG_CRC_BYPASS_Pos 2UL
#define USBFS_USBDEV_ARB_EP6_CFG_CRC_BYPASS_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP6_CFG_RESET_PTR_Pos  3UL
#define USBFS_USBDEV_ARB_EP6_CFG_RESET_PTR_Msk  0x8UL
/* USBFS_USBDEV.ARB_EP6_INT_EN */
#define USBFS_USBDEV_ARB_EP6_INT_EN_IN_BUF_FULL_EN_Pos 0UL
#define USBFS_USBDEV_ARB_EP6_INT_EN_IN_BUF_FULL_EN_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP6_INT_EN_DMA_GNT_EN_Pos 1UL
#define USBFS_USBDEV_ARB_EP6_INT_EN_DMA_GNT_EN_Msk 0x2UL
#define USBFS_USBDEV_ARB_EP6_INT_EN_BUF_OVER_EN_Pos 2UL
#define USBFS_USBDEV_ARB_EP6_INT_EN_BUF_OVER_EN_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP6_INT_EN_BUF_UNDER_EN_Pos 3UL
#define USBFS_USBDEV_ARB_EP6_INT_EN_BUF_UNDER_EN_Msk 0x8UL
#define USBFS_USBDEV_ARB_EP6_INT_EN_ERR_INT_EN_Pos 4UL
#define USBFS_USBDEV_ARB_EP6_INT_EN_ERR_INT_EN_Msk 0x10UL
#define USBFS_USBDEV_ARB_EP6_INT_EN_DMA_TERMIN_EN_Pos 5UL
#define USBFS_USBDEV_ARB_EP6_INT_EN_DMA_TERMIN_EN_Msk 0x20UL
/* USBFS_USBDEV.ARB_EP6_SR */
#define USBFS_USBDEV_ARB_EP6_SR_IN_BUF_FULL_Pos 0UL
#define USBFS_USBDEV_ARB_EP6_SR_IN_BUF_FULL_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP6_SR_DMA_GNT_Pos     1UL
#define USBFS_USBDEV_ARB_EP6_SR_DMA_GNT_Msk     0x2UL
#define USBFS_USBDEV_ARB_EP6_SR_BUF_OVER_Pos    2UL
#define USBFS_USBDEV_ARB_EP6_SR_BUF_OVER_Msk    0x4UL
#define USBFS_USBDEV_ARB_EP6_SR_BUF_UNDER_Pos   3UL
#define USBFS_USBDEV_ARB_EP6_SR_BUF_UNDER_Msk   0x8UL
#define USBFS_USBDEV_ARB_EP6_SR_DMA_TERMIN_Pos  5UL
#define USBFS_USBDEV_ARB_EP6_SR_DMA_TERMIN_Msk  0x20UL
/* USBFS_USBDEV.ARB_RW6_WA */
#define USBFS_USBDEV_ARB_RW6_WA_WA_Pos          0UL
#define USBFS_USBDEV_ARB_RW6_WA_WA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW6_WA_MSB */
#define USBFS_USBDEV_ARB_RW6_WA_MSB_WA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW6_WA_MSB_WA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW6_RA */
#define USBFS_USBDEV_ARB_RW6_RA_RA_Pos          0UL
#define USBFS_USBDEV_ARB_RW6_RA_RA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW6_RA_MSB */
#define USBFS_USBDEV_ARB_RW6_RA_MSB_RA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW6_RA_MSB_RA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW6_DR */
#define USBFS_USBDEV_ARB_RW6_DR_DR_Pos          0UL
#define USBFS_USBDEV_ARB_RW6_DR_DR_Msk          0xFFUL
/* USBFS_USBDEV.ARB_EP7_CFG */
#define USBFS_USBDEV_ARB_EP7_CFG_IN_DATA_RDY_Pos 0UL
#define USBFS_USBDEV_ARB_EP7_CFG_IN_DATA_RDY_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP7_CFG_DMA_REQ_Pos    1UL
#define USBFS_USBDEV_ARB_EP7_CFG_DMA_REQ_Msk    0x2UL
#define USBFS_USBDEV_ARB_EP7_CFG_CRC_BYPASS_Pos 2UL
#define USBFS_USBDEV_ARB_EP7_CFG_CRC_BYPASS_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP7_CFG_RESET_PTR_Pos  3UL
#define USBFS_USBDEV_ARB_EP7_CFG_RESET_PTR_Msk  0x8UL
/* USBFS_USBDEV.ARB_EP7_INT_EN */
#define USBFS_USBDEV_ARB_EP7_INT_EN_IN_BUF_FULL_EN_Pos 0UL
#define USBFS_USBDEV_ARB_EP7_INT_EN_IN_BUF_FULL_EN_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP7_INT_EN_DMA_GNT_EN_Pos 1UL
#define USBFS_USBDEV_ARB_EP7_INT_EN_DMA_GNT_EN_Msk 0x2UL
#define USBFS_USBDEV_ARB_EP7_INT_EN_BUF_OVER_EN_Pos 2UL
#define USBFS_USBDEV_ARB_EP7_INT_EN_BUF_OVER_EN_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP7_INT_EN_BUF_UNDER_EN_Pos 3UL
#define USBFS_USBDEV_ARB_EP7_INT_EN_BUF_UNDER_EN_Msk 0x8UL
#define USBFS_USBDEV_ARB_EP7_INT_EN_ERR_INT_EN_Pos 4UL
#define USBFS_USBDEV_ARB_EP7_INT_EN_ERR_INT_EN_Msk 0x10UL
#define USBFS_USBDEV_ARB_EP7_INT_EN_DMA_TERMIN_EN_Pos 5UL
#define USBFS_USBDEV_ARB_EP7_INT_EN_DMA_TERMIN_EN_Msk 0x20UL
/* USBFS_USBDEV.ARB_EP7_SR */
#define USBFS_USBDEV_ARB_EP7_SR_IN_BUF_FULL_Pos 0UL
#define USBFS_USBDEV_ARB_EP7_SR_IN_BUF_FULL_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP7_SR_DMA_GNT_Pos     1UL
#define USBFS_USBDEV_ARB_EP7_SR_DMA_GNT_Msk     0x2UL
#define USBFS_USBDEV_ARB_EP7_SR_BUF_OVER_Pos    2UL
#define USBFS_USBDEV_ARB_EP7_SR_BUF_OVER_Msk    0x4UL
#define USBFS_USBDEV_ARB_EP7_SR_BUF_UNDER_Pos   3UL
#define USBFS_USBDEV_ARB_EP7_SR_BUF_UNDER_Msk   0x8UL
#define USBFS_USBDEV_ARB_EP7_SR_DMA_TERMIN_Pos  5UL
#define USBFS_USBDEV_ARB_EP7_SR_DMA_TERMIN_Msk  0x20UL
/* USBFS_USBDEV.ARB_RW7_WA */
#define USBFS_USBDEV_ARB_RW7_WA_WA_Pos          0UL
#define USBFS_USBDEV_ARB_RW7_WA_WA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW7_WA_MSB */
#define USBFS_USBDEV_ARB_RW7_WA_MSB_WA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW7_WA_MSB_WA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW7_RA */
#define USBFS_USBDEV_ARB_RW7_RA_RA_Pos          0UL
#define USBFS_USBDEV_ARB_RW7_RA_RA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW7_RA_MSB */
#define USBFS_USBDEV_ARB_RW7_RA_MSB_RA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW7_RA_MSB_RA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW7_DR */
#define USBFS_USBDEV_ARB_RW7_DR_DR_Pos          0UL
#define USBFS_USBDEV_ARB_RW7_DR_DR_Msk          0xFFUL
/* USBFS_USBDEV.ARB_EP8_CFG */
#define USBFS_USBDEV_ARB_EP8_CFG_IN_DATA_RDY_Pos 0UL
#define USBFS_USBDEV_ARB_EP8_CFG_IN_DATA_RDY_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP8_CFG_DMA_REQ_Pos    1UL
#define USBFS_USBDEV_ARB_EP8_CFG_DMA_REQ_Msk    0x2UL
#define USBFS_USBDEV_ARB_EP8_CFG_CRC_BYPASS_Pos 2UL
#define USBFS_USBDEV_ARB_EP8_CFG_CRC_BYPASS_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP8_CFG_RESET_PTR_Pos  3UL
#define USBFS_USBDEV_ARB_EP8_CFG_RESET_PTR_Msk  0x8UL
/* USBFS_USBDEV.ARB_EP8_INT_EN */
#define USBFS_USBDEV_ARB_EP8_INT_EN_IN_BUF_FULL_EN_Pos 0UL
#define USBFS_USBDEV_ARB_EP8_INT_EN_IN_BUF_FULL_EN_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP8_INT_EN_DMA_GNT_EN_Pos 1UL
#define USBFS_USBDEV_ARB_EP8_INT_EN_DMA_GNT_EN_Msk 0x2UL
#define USBFS_USBDEV_ARB_EP8_INT_EN_BUF_OVER_EN_Pos 2UL
#define USBFS_USBDEV_ARB_EP8_INT_EN_BUF_OVER_EN_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP8_INT_EN_BUF_UNDER_EN_Pos 3UL
#define USBFS_USBDEV_ARB_EP8_INT_EN_BUF_UNDER_EN_Msk 0x8UL
#define USBFS_USBDEV_ARB_EP8_INT_EN_ERR_INT_EN_Pos 4UL
#define USBFS_USBDEV_ARB_EP8_INT_EN_ERR_INT_EN_Msk 0x10UL
#define USBFS_USBDEV_ARB_EP8_INT_EN_DMA_TERMIN_EN_Pos 5UL
#define USBFS_USBDEV_ARB_EP8_INT_EN_DMA_TERMIN_EN_Msk 0x20UL
/* USBFS_USBDEV.ARB_EP8_SR */
#define USBFS_USBDEV_ARB_EP8_SR_IN_BUF_FULL_Pos 0UL
#define USBFS_USBDEV_ARB_EP8_SR_IN_BUF_FULL_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP8_SR_DMA_GNT_Pos     1UL
#define USBFS_USBDEV_ARB_EP8_SR_DMA_GNT_Msk     0x2UL
#define USBFS_USBDEV_ARB_EP8_SR_BUF_OVER_Pos    2UL
#define USBFS_USBDEV_ARB_EP8_SR_BUF_OVER_Msk    0x4UL
#define USBFS_USBDEV_ARB_EP8_SR_BUF_UNDER_Pos   3UL
#define USBFS_USBDEV_ARB_EP8_SR_BUF_UNDER_Msk   0x8UL
#define USBFS_USBDEV_ARB_EP8_SR_DMA_TERMIN_Pos  5UL
#define USBFS_USBDEV_ARB_EP8_SR_DMA_TERMIN_Msk  0x20UL
/* USBFS_USBDEV.ARB_RW8_WA */
#define USBFS_USBDEV_ARB_RW8_WA_WA_Pos          0UL
#define USBFS_USBDEV_ARB_RW8_WA_WA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW8_WA_MSB */
#define USBFS_USBDEV_ARB_RW8_WA_MSB_WA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW8_WA_MSB_WA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW8_RA */
#define USBFS_USBDEV_ARB_RW8_RA_RA_Pos          0UL
#define USBFS_USBDEV_ARB_RW8_RA_RA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW8_RA_MSB */
#define USBFS_USBDEV_ARB_RW8_RA_MSB_RA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW8_RA_MSB_RA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW8_DR */
#define USBFS_USBDEV_ARB_RW8_DR_DR_Pos          0UL
#define USBFS_USBDEV_ARB_RW8_DR_DR_Msk          0xFFUL
/* USBFS_USBDEV.MEM_DATA */
#define USBFS_USBDEV_MEM_DATA_DR_Pos            0UL
#define USBFS_USBDEV_MEM_DATA_DR_Msk            0xFFUL
/* USBFS_USBDEV.SOF16 */
#define USBFS_USBDEV_SOF16_FRAME_NUMBER16_Pos   0UL
#define USBFS_USBDEV_SOF16_FRAME_NUMBER16_Msk   0x7FFUL
/* USBFS_USBDEV.OSCLK_DR16 */
#define USBFS_USBDEV_OSCLK_DR16_ADDER16_Pos     0UL
#define USBFS_USBDEV_OSCLK_DR16_ADDER16_Msk     0x7FFFUL
/* USBFS_USBDEV.ARB_RW1_WA16 */
#define USBFS_USBDEV_ARB_RW1_WA16_WA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW1_WA16_WA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW1_RA16 */
#define USBFS_USBDEV_ARB_RW1_RA16_RA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW1_RA16_RA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW1_DR16 */
#define USBFS_USBDEV_ARB_RW1_DR16_DR16_Pos      0UL
#define USBFS_USBDEV_ARB_RW1_DR16_DR16_Msk      0xFFFFUL
/* USBFS_USBDEV.ARB_RW2_WA16 */
#define USBFS_USBDEV_ARB_RW2_WA16_WA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW2_WA16_WA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW2_RA16 */
#define USBFS_USBDEV_ARB_RW2_RA16_RA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW2_RA16_RA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW2_DR16 */
#define USBFS_USBDEV_ARB_RW2_DR16_DR16_Pos      0UL
#define USBFS_USBDEV_ARB_RW2_DR16_DR16_Msk      0xFFFFUL
/* USBFS_USBDEV.ARB_RW3_WA16 */
#define USBFS_USBDEV_ARB_RW3_WA16_WA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW3_WA16_WA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW3_RA16 */
#define USBFS_USBDEV_ARB_RW3_RA16_RA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW3_RA16_RA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW3_DR16 */
#define USBFS_USBDEV_ARB_RW3_DR16_DR16_Pos      0UL
#define USBFS_USBDEV_ARB_RW3_DR16_DR16_Msk      0xFFFFUL
/* USBFS_USBDEV.CWA16 */
#define USBFS_USBDEV_CWA16_CWA16_Pos            0UL
#define USBFS_USBDEV_CWA16_CWA16_Msk            0x1FFUL
/* USBFS_USBDEV.ARB_RW4_WA16 */
#define USBFS_USBDEV_ARB_RW4_WA16_WA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW4_WA16_WA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW4_RA16 */
#define USBFS_USBDEV_ARB_RW4_RA16_RA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW4_RA16_RA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW4_DR16 */
#define USBFS_USBDEV_ARB_RW4_DR16_DR16_Pos      0UL
#define USBFS_USBDEV_ARB_RW4_DR16_DR16_Msk      0xFFFFUL
/* USBFS_USBDEV.DMA_THRES16 */
#define USBFS_USBDEV_DMA_THRES16_DMA_THS16_Pos  0UL
#define USBFS_USBDEV_DMA_THRES16_DMA_THS16_Msk  0x1FFUL
/* USBFS_USBDEV.ARB_RW5_WA16 */
#define USBFS_USBDEV_ARB_RW5_WA16_WA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW5_WA16_WA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW5_RA16 */
#define USBFS_USBDEV_ARB_RW5_RA16_RA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW5_RA16_RA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW5_DR16 */
#define USBFS_USBDEV_ARB_RW5_DR16_DR16_Pos      0UL
#define USBFS_USBDEV_ARB_RW5_DR16_DR16_Msk      0xFFFFUL
/* USBFS_USBDEV.ARB_RW6_WA16 */
#define USBFS_USBDEV_ARB_RW6_WA16_WA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW6_WA16_WA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW6_RA16 */
#define USBFS_USBDEV_ARB_RW6_RA16_RA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW6_RA16_RA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW6_DR16 */
#define USBFS_USBDEV_ARB_RW6_DR16_DR16_Pos      0UL
#define USBFS_USBDEV_ARB_RW6_DR16_DR16_Msk      0xFFFFUL
/* USBFS_USBDEV.ARB_RW7_WA16 */
#define USBFS_USBDEV_ARB_RW7_WA16_WA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW7_WA16_WA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW7_RA16 */
#define USBFS_USBDEV_ARB_RW7_RA16_RA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW7_RA16_RA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW7_DR16 */
#define USBFS_USBDEV_ARB_RW7_DR16_DR16_Pos      0UL
#define USBFS_USBDEV_ARB_RW7_DR16_DR16_Msk      0xFFFFUL
/* USBFS_USBDEV.ARB_RW8_WA16 */
#define USBFS_USBDEV_ARB_RW8_WA16_WA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW8_WA16_WA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW8_RA16 */
#define USBFS_USBDEV_ARB_RW8_RA16_RA16_Pos      0UL
#define USBFS_USBDEV_ARB_RW8_RA16_RA16_Msk      0x1FFUL
/* USBFS_USBDEV.ARB_RW8_DR16 */
#define USBFS_USBDEV_ARB_RW8_DR16_DR16_Pos      0UL
#define USBFS_USBDEV_ARB_RW8_DR16_DR16_Msk      0xFFFFUL


