ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/devices/include/ip/cyip_usbfs.h
/* USBFS_USBHOST.HOST_CTL0 */
#define USBFS_USBHOST_HOST_CTL0_HOST_Pos        0UL
#define USBFS_USBHOST_HOST_CTL0_HOST_Msk        0x1UL
#define USBFS_USBHOST_HOST_CTL0_ENABLE_Pos      31UL
#define USBFS_USBHOST_HOST_CTL0_ENABLE_Msk      0x80000000UL
/* USBFS_USBHOST.HOST_CTL1 */
#define USBFS_USBHOST_HOST_CTL1_CLKSEL_Pos      0UL
#define USBFS_USBHOST_HOST_CTL1_CLKSEL_Msk      0x1UL
#define USBFS_USBHOST_HOST_CTL1_USTP_Pos        1UL
#define USBFS_USBHOST_HOST_CTL1_USTP_Msk        0x2UL
#define USBFS_USBHOST_HOST_CTL1_RST_Pos         7UL
#define USBFS_USBHOST_HOST_CTL1_RST_Msk         0x80UL
/* USBFS_USBHOST.HOST_CTL2 */
#define USBFS_USBHOST_HOST_CTL2_RETRY_Pos       0UL
#define USBFS_USBHOST_HOST_CTL2_RETRY_Msk       0x1UL
#define USBFS_USBHOST_HOST_CTL2_CANCEL_Pos      1UL
#define USBFS_USBHOST_HOST_CTL2_CANCEL_Msk      0x2UL
#define USBFS_USBHOST_HOST_CTL2_SOFSTEP_Pos     2UL
#define USBFS_USBHOST_HOST_CTL2_SOFSTEP_Msk     0x4UL
#define USBFS_USBHOST_HOST_CTL2_ALIVE_Pos       3UL
#define USBFS_USBHOST_HOST_CTL2_ALIVE_Msk       0x8UL
#define USBFS_USBHOST_HOST_CTL2_RESERVED_4_Pos  4UL
#define USBFS_USBHOST_HOST_CTL2_RESERVED_4_Msk  0x10UL
#define USBFS_USBHOST_HOST_CTL2_RESERVED_5_Pos  5UL
#define USBFS_USBHOST_HOST_CTL2_RESERVED_5_Msk  0x20UL
#define USBFS_USBHOST_HOST_CTL2_TTEST_Pos       6UL
#define USBFS_USBHOST_HOST_CTL2_TTEST_Msk       0xC0UL
/* USBFS_USBHOST.HOST_ERR */
#define USBFS_USBHOST_HOST_ERR_HS_Pos           0UL
#define USBFS_USBHOST_HOST_ERR_HS_Msk           0x3UL
#define USBFS_USBHOST_HOST_ERR_STUFF_Pos        2UL
#define USBFS_USBHOST_HOST_ERR_STUFF_Msk        0x4UL
#define USBFS_USBHOST_HOST_ERR_TGERR_Pos        3UL
#define USBFS_USBHOST_HOST_ERR_TGERR_Msk        0x8UL
#define USBFS_USBHOST_HOST_ERR_CRC_Pos          4UL
#define USBFS_USBHOST_HOST_ERR_CRC_Msk          0x10UL
#define USBFS_USBHOST_HOST_ERR_TOUT_Pos         5UL
#define USBFS_USBHOST_HOST_ERR_TOUT_Msk         0x20UL
#define USBFS_USBHOST_HOST_ERR_RERR_Pos         6UL
#define USBFS_USBHOST_HOST_ERR_RERR_Msk         0x40UL
#define USBFS_USBHOST_HOST_ERR_LSTSOF_Pos       7UL
#define USBFS_USBHOST_HOST_ERR_LSTSOF_Msk       0x80UL
/* USBFS_USBHOST.HOST_STATUS */
#define USBFS_USBHOST_HOST_STATUS_CSTAT_Pos     0UL
#define USBFS_USBHOST_HOST_STATUS_CSTAT_Msk     0x1UL
#define USBFS_USBHOST_HOST_STATUS_TMODE_Pos     1UL
#define USBFS_USBHOST_HOST_STATUS_TMODE_Msk     0x2UL
#define USBFS_USBHOST_HOST_STATUS_SUSP_Pos      2UL
#define USBFS_USBHOST_HOST_STATUS_SUSP_Msk      0x4UL
#define USBFS_USBHOST_HOST_STATUS_SOFBUSY_Pos   3UL
#define USBFS_USBHOST_HOST_STATUS_SOFBUSY_Msk   0x8UL
#define USBFS_USBHOST_HOST_STATUS_URST_Pos      4UL
#define USBFS_USBHOST_HOST_STATUS_URST_Msk      0x10UL
#define USBFS_USBHOST_HOST_STATUS_RESERVED_5_Pos 5UL
#define USBFS_USBHOST_HOST_STATUS_RESERVED_5_Msk 0x20UL
#define USBFS_USBHOST_HOST_STATUS_RSTBUSY_Pos   6UL
#define USBFS_USBHOST_HOST_STATUS_RSTBUSY_Msk   0x40UL
#define USBFS_USBHOST_HOST_STATUS_CLKSEL_ST_Pos 7UL
#define USBFS_USBHOST_HOST_STATUS_CLKSEL_ST_Msk 0x80UL
#define USBFS_USBHOST_HOST_STATUS_HOST_ST_Pos   8UL
#define USBFS_USBHOST_HOST_STATUS_HOST_ST_Msk   0x100UL
/* USBFS_USBHOST.HOST_FCOMP */
#define USBFS_USBHOST_HOST_FCOMP_FRAMECOMP_Pos  0UL
#define USBFS_USBHOST_HOST_FCOMP_FRAMECOMP_Msk  0xFFUL
/* USBFS_USBHOST.HOST_RTIMER */
#define USBFS_USBHOST_HOST_RTIMER_RTIMER_Pos    0UL
#define USBFS_USBHOST_HOST_RTIMER_RTIMER_Msk    0x3FFFFUL
/* USBFS_USBHOST.HOST_ADDR */
#define USBFS_USBHOST_HOST_ADDR_ADDRESS_Pos     0UL
#define USBFS_USBHOST_HOST_ADDR_ADDRESS_Msk     0x7FUL
/* USBFS_USBHOST.HOST_EOF */
#define USBFS_USBHOST_HOST_EOF_EOF_Pos          0UL
#define USBFS_USBHOST_HOST_EOF_EOF_Msk          0x3FFFUL
/* USBFS_USBHOST.HOST_FRAME */
#define USBFS_USBHOST_HOST_FRAME_FRAME_Pos      0UL
#define USBFS_USBHOST_HOST_FRAME_FRAME_Msk      0x7FFUL
/* USBFS_USBHOST.HOST_TOKEN */
#define USBFS_USBHOST_HOST_TOKEN_ENDPT_Pos      0UL
#define USBFS_USBHOST_HOST_TOKEN_ENDPT_Msk      0xFUL
#define USBFS_USBHOST_HOST_TOKEN_TKNEN_Pos      4UL
#define USBFS_USBHOST_HOST_TOKEN_TKNEN_Msk      0x70UL
#define USBFS_USBHOST_HOST_TOKEN_TGGL_Pos       8UL
#define USBFS_USBHOST_HOST_TOKEN_TGGL_Msk       0x100UL
/* USBFS_USBHOST.HOST_EP1_CTL */
#define USBFS_USBHOST_HOST_EP1_CTL_PKS1_Pos     0UL
#define USBFS_USBHOST_HOST_EP1_CTL_PKS1_Msk     0x1FFUL
#define USBFS_USBHOST_HOST_EP1_CTL_NULLE_Pos    10UL
#define USBFS_USBHOST_HOST_EP1_CTL_NULLE_Msk    0x400UL
#define USBFS_USBHOST_HOST_EP1_CTL_DMAE_Pos     11UL
#define USBFS_USBHOST_HOST_EP1_CTL_DMAE_Msk     0x800UL
#define USBFS_USBHOST_HOST_EP1_CTL_DIR_Pos      12UL
#define USBFS_USBHOST_HOST_EP1_CTL_DIR_Msk      0x1000UL
#define USBFS_USBHOST_HOST_EP1_CTL_BFINI_Pos    15UL
#define USBFS_USBHOST_HOST_EP1_CTL_BFINI_Msk    0x8000UL
/* USBFS_USBHOST.HOST_EP1_STATUS */
#define USBFS_USBHOST_HOST_EP1_STATUS_SIZE1_Pos 0UL
#define USBFS_USBHOST_HOST_EP1_STATUS_SIZE1_Msk 0x1FFUL
#define USBFS_USBHOST_HOST_EP1_STATUS_VAL_DATA_Pos 16UL
#define USBFS_USBHOST_HOST_EP1_STATUS_VAL_DATA_Msk 0x10000UL
#define USBFS_USBHOST_HOST_EP1_STATUS_INI_ST_Pos 17UL
#define USBFS_USBHOST_HOST_EP1_STATUS_INI_ST_Msk 0x20000UL
#define USBFS_USBHOST_HOST_EP1_STATUS_RESERVED_18_Pos 18UL
#define USBFS_USBHOST_HOST_EP1_STATUS_RESERVED_18_Msk 0x40000UL
/* USBFS_USBHOST.HOST_EP1_RW1_DR */
#define USBFS_USBHOST_HOST_EP1_RW1_DR_BFDT8_Pos 0UL
#define USBFS_USBHOST_HOST_EP1_RW1_DR_BFDT8_Msk 0xFFUL
/* USBFS_USBHOST.HOST_EP1_RW2_DR */
#define USBFS_USBHOST_HOST_EP1_RW2_DR_BFDT16_Pos 0UL
#define USBFS_USBHOST_HOST_EP1_RW2_DR_BFDT16_Msk 0xFFFFUL
/* USBFS_USBHOST.HOST_EP2_CTL */
#define USBFS_USBHOST_HOST_EP2_CTL_PKS2_Pos     0UL
#define USBFS_USBHOST_HOST_EP2_CTL_PKS2_Msk     0x7FUL
#define USBFS_USBHOST_HOST_EP2_CTL_NULLE_Pos    10UL
#define USBFS_USBHOST_HOST_EP2_CTL_NULLE_Msk    0x400UL
#define USBFS_USBHOST_HOST_EP2_CTL_DMAE_Pos     11UL
#define USBFS_USBHOST_HOST_EP2_CTL_DMAE_Msk     0x800UL
#define USBFS_USBHOST_HOST_EP2_CTL_DIR_Pos      12UL
#define USBFS_USBHOST_HOST_EP2_CTL_DIR_Msk      0x1000UL
#define USBFS_USBHOST_HOST_EP2_CTL_BFINI_Pos    15UL
#define USBFS_USBHOST_HOST_EP2_CTL_BFINI_Msk    0x8000UL
/* USBFS_USBHOST.HOST_EP2_STATUS */
#define USBFS_USBHOST_HOST_EP2_STATUS_SIZE2_Pos 0UL
#define USBFS_USBHOST_HOST_EP2_STATUS_SIZE2_Msk 0x7FUL
#define USBFS_USBHOST_HOST_EP2_STATUS_VAL_DATA_Pos 16UL
#define USBFS_USBHOST_HOST_EP2_STATUS_VAL_DATA_Msk 0x10000UL
#define USBFS_USBHOST_HOST_EP2_STATUS_INI_ST_Pos 17UL
#define USBFS_USBHOST_HOST_EP2_STATUS_INI_ST_Msk 0x20000UL
#define USBFS_USBHOST_HOST_EP2_STATUS_RESERVED_18_Pos 18UL
#define USBFS_USBHOST_HOST_EP2_STATUS_RESERVED_18_Msk 0x40000UL
/* USBFS_USBHOST.HOST_EP2_RW1_DR */
#define USBFS_USBHOST_HOST_EP2_RW1_DR_BFDT8_Pos 0UL
#define USBFS_USBHOST_HOST_EP2_RW1_DR_BFDT8_Msk 0xFFUL
/* USBFS_USBHOST.HOST_EP2_RW2_DR */
#define USBFS_USBHOST_HOST_EP2_RW2_DR_BFDT16_Pos 0UL
#define USBFS_USBHOST_HOST_EP2_RW2_DR_BFDT16_Msk 0xFFFFUL
/* USBFS_USBHOST.HOST_LVL1_SEL */
#define USBFS_USBHOST_HOST_LVL1_SEL_SOFIRQ_SEL_Pos 0UL
#define USBFS_USBHOST_HOST_LVL1_SEL_SOFIRQ_SEL_Msk 0x3UL
#define USBFS_USBHOST_HOST_LVL1_SEL_DIRQ_SEL_Pos 2UL
#define USBFS_USBHOST_HOST_LVL1_SEL_DIRQ_SEL_Msk 0xCUL
#define USBFS_USBHOST_HOST_LVL1_SEL_CNNIRQ_SEL_Pos 4UL
#define USBFS_USBHOST_HOST_LVL1_SEL_CNNIRQ_SEL_Msk 0x30UL
#define USBFS_USBHOST_HOST_LVL1_SEL_CMPIRQ_SEL_Pos 6UL
#define USBFS_USBHOST_HOST_LVL1_SEL_CMPIRQ_SEL_Msk 0xC0UL
#define USBFS_USBHOST_HOST_LVL1_SEL_URIRQ_SEL_Pos 8UL
#define USBFS_USBHOST_HOST_LVL1_SEL_URIRQ_SEL_Msk 0x300UL
#define USBFS_USBHOST_HOST_LVL1_SEL_RWKIRQ_SEL_Pos 10UL
#define USBFS_USBHOST_HOST_LVL1_SEL_RWKIRQ_SEL_Msk 0xC00UL
#define USBFS_USBHOST_HOST_LVL1_SEL_RESERVED_13_12_Pos 12UL
#define USBFS_USBHOST_HOST_LVL1_SEL_RESERVED_13_12_Msk 0x3000UL
#define USBFS_USBHOST_HOST_LVL1_SEL_TCAN_SEL_Pos 14UL
#define USBFS_USBHOST_HOST_LVL1_SEL_TCAN_SEL_Msk 0xC000UL
/* USBFS_USBHOST.HOST_LVL2_SEL */
#define USBFS_USBHOST_HOST_LVL2_SEL_EP1_DRQ_SEL_Pos 4UL
#define USBFS_USBHOST_HOST_LVL2_SEL_EP1_DRQ_SEL_Msk 0x30UL
#define USBFS_USBHOST_HOST_LVL2_SEL_EP1_SPK_SEL_Pos 6UL
#define USBFS_USBHOST_HOST_LVL2_SEL_EP1_SPK_SEL_Msk 0xC0UL
#define USBFS_USBHOST_HOST_LVL2_SEL_EP2_DRQ_SEL_Pos 8UL
#define USBFS_USBHOST_HOST_LVL2_SEL_EP2_DRQ_SEL_Msk 0x300UL
#define USBFS_USBHOST_HOST_LVL2_SEL_EP2_SPK_SEL_Pos 10UL
#define USBFS_USBHOST_HOST_LVL2_SEL_EP2_SPK_SEL_Msk 0xC00UL
/* USBFS_USBHOST.INTR_USBHOST_CAUSE_HI */
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_SOFIRQ_INT_Pos 0UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_SOFIRQ_INT_Msk 0x1UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_DIRQ_INT_Pos 1UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_DIRQ_INT_Msk 0x2UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_CNNIRQ_INT_Pos 2UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_CNNIRQ_INT_Msk 0x4UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_CMPIRQ_INT_Pos 3UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_CMPIRQ_INT_Msk 0x8UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_URIRQ_INT_Pos 4UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_URIRQ_INT_Msk 0x10UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_RWKIRQ_INT_Pos 5UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_RWKIRQ_INT_Msk 0x20UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_RESERVED_6_Pos 6UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_RESERVED_6_Msk 0x40UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_TCAN_INT_Pos 7UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_HI_TCAN_INT_Msk 0x80UL
/* USBFS_USBHOST.INTR_USBHOST_CAUSE_MED */
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_SOFIRQ_INT_Pos 0UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_SOFIRQ_INT_Msk 0x1UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_DIRQ_INT_Pos 1UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_DIRQ_INT_Msk 0x2UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_CNNIRQ_INT_Pos 2UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_CNNIRQ_INT_Msk 0x4UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_CMPIRQ_INT_Pos 3UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_CMPIRQ_INT_Msk 0x8UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_URIRQ_INT_Pos 4UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_URIRQ_INT_Msk 0x10UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_RWKIRQ_INT_Pos 5UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_RWKIRQ_INT_Msk 0x20UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_RESERVED_6_Pos 6UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_RESERVED_6_Msk 0x40UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_TCAN_INT_Pos 7UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_MED_TCAN_INT_Msk 0x80UL
/* USBFS_USBHOST.INTR_USBHOST_CAUSE_LO */
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_SOFIRQ_INT_Pos 0UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_SOFIRQ_INT_Msk 0x1UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_DIRQ_INT_Pos 1UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_DIRQ_INT_Msk 0x2UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_CNNIRQ_INT_Pos 2UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_CNNIRQ_INT_Msk 0x4UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_CMPIRQ_INT_Pos 3UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_CMPIRQ_INT_Msk 0x8UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_URIRQ_INT_Pos 4UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_URIRQ_INT_Msk 0x10UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_RWKIRQ_INT_Pos 5UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_RWKIRQ_INT_Msk 0x20UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_RESERVED_6_Pos 6UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_RESERVED_6_Msk 0x40UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_TCAN_INT_Pos 7UL
#define USBFS_USBHOST_INTR_USBHOST_CAUSE_LO_TCAN_INT_Msk 0x80UL
/* USBFS_USBHOST.INTR_HOST_EP_CAUSE_HI */
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_HI_EP1DRQ_INT_Pos 2UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_HI_EP1DRQ_INT_Msk 0x4UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_HI_EP1SPK_INT_Pos 3UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_HI_EP1SPK_INT_Msk 0x8UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_HI_EP2DRQ_INT_Pos 4UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_HI_EP2DRQ_INT_Msk 0x10UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_HI_EP2SPK_INT_Pos 5UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_HI_EP2SPK_INT_Msk 0x20UL
/* USBFS_USBHOST.INTR_HOST_EP_CAUSE_MED */
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_MED_EP1DRQ_INT_Pos 2UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_MED_EP1DRQ_INT_Msk 0x4UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_MED_EP1SPK_INT_Pos 3UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_MED_EP1SPK_INT_Msk 0x8UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_MED_EP2DRQ_INT_Pos 4UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_MED_EP2DRQ_INT_Msk 0x10UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_MED_EP2SPK_INT_Pos 5UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_MED_EP2SPK_INT_Msk 0x20UL
/* USBFS_USBHOST.INTR_HOST_EP_CAUSE_LO */
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_LO_EP1DRQ_INT_Pos 2UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_LO_EP1DRQ_INT_Msk 0x4UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_LO_EP1SPK_INT_Pos 3UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_LO_EP1SPK_INT_Msk 0x8UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_LO_EP2DRQ_INT_Pos 4UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_LO_EP2DRQ_INT_Msk 0x10UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_LO_EP2SPK_INT_Pos 5UL
#define USBFS_USBHOST_INTR_HOST_EP_CAUSE_LO_EP2SPK_INT_Msk 0x20UL
/* USBFS_USBHOST.INTR_USBHOST */
#define USBFS_USBHOST_INTR_USBHOST_SOFIRQ_Pos   0UL
#define USBFS_USBHOST_INTR_USBHOST_SOFIRQ_Msk   0x1UL
#define USBFS_USBHOST_INTR_USBHOST_DIRQ_Pos     1UL
#define USBFS_USBHOST_INTR_USBHOST_DIRQ_Msk     0x2UL
#define USBFS_USBHOST_INTR_USBHOST_CNNIRQ_Pos   2UL
#define USBFS_USBHOST_INTR_USBHOST_CNNIRQ_Msk   0x4UL
#define USBFS_USBHOST_INTR_USBHOST_CMPIRQ_Pos   3UL
#define USBFS_USBHOST_INTR_USBHOST_CMPIRQ_Msk   0x8UL
#define USBFS_USBHOST_INTR_USBHOST_URIRQ_Pos    4UL
#define USBFS_USBHOST_INTR_USBHOST_URIRQ_Msk    0x10UL
#define USBFS_USBHOST_INTR_USBHOST_RWKIRQ_Pos   5UL
#define USBFS_USBHOST_INTR_USBHOST_RWKIRQ_Msk   0x20UL
#define USBFS_USBHOST_INTR_USBHOST_RESERVED_6_Pos 6UL
#define USBFS_USBHOST_INTR_USBHOST_RESERVED_6_Msk 0x40UL
#define USBFS_USBHOST_INTR_USBHOST_TCAN_Pos     7UL
#define USBFS_USBHOST_INTR_USBHOST_TCAN_Msk     0x80UL
/* USBFS_USBHOST.INTR_USBHOST_SET */
#define USBFS_USBHOST_INTR_USBHOST_SET_SOFIRQS_Pos 0UL
#define USBFS_USBHOST_INTR_USBHOST_SET_SOFIRQS_Msk 0x1UL
#define USBFS_USBHOST_INTR_USBHOST_SET_DIRQS_Pos 1UL
#define USBFS_USBHOST_INTR_USBHOST_SET_DIRQS_Msk 0x2UL
#define USBFS_USBHOST_INTR_USBHOST_SET_CNNIRQS_Pos 2UL
#define USBFS_USBHOST_INTR_USBHOST_SET_CNNIRQS_Msk 0x4UL
#define USBFS_USBHOST_INTR_USBHOST_SET_CMPIRQS_Pos 3UL
#define USBFS_USBHOST_INTR_USBHOST_SET_CMPIRQS_Msk 0x8UL
#define USBFS_USBHOST_INTR_USBHOST_SET_URIRQS_Pos 4UL
#define USBFS_USBHOST_INTR_USBHOST_SET_URIRQS_Msk 0x10UL
#define USBFS_USBHOST_INTR_USBHOST_SET_RWKIRQS_Pos 5UL
#define USBFS_USBHOST_INTR_USBHOST_SET_RWKIRQS_Msk 0x20UL
#define USBFS_USBHOST_INTR_USBHOST_SET_RESERVED_6_Pos 6UL
#define USBFS_USBHOST_INTR_USBHOST_SET_RESERVED_6_Msk 0x40UL
#define USBFS_USBHOST_INTR_USBHOST_SET_TCANS_Pos 7UL
#define USBFS_USBHOST_INTR_USBHOST_SET_TCANS_Msk 0x80UL
/* USBFS_USBHOST.INTR_USBHOST_MASK */
#define USBFS_USBHOST_INTR_USBHOST_MASK_SOFIRQM_Pos 0UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_SOFIRQM_Msk 0x1UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_DIRQM_Pos 1UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_DIRQM_Msk 0x2UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_CNNIRQM_Pos 2UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_CNNIRQM_Msk 0x4UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_CMPIRQM_Pos 3UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_CMPIRQM_Msk 0x8UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_URIRQM_Pos 4UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_URIRQM_Msk 0x10UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_RWKIRQM_Pos 5UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_RWKIRQM_Msk 0x20UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_RESERVED_6_Pos 6UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_RESERVED_6_Msk 0x40UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_TCANM_Pos 7UL
#define USBFS_USBHOST_INTR_USBHOST_MASK_TCANM_Msk 0x80UL
/* USBFS_USBHOST.INTR_USBHOST_MASKED */
#define USBFS_USBHOST_INTR_USBHOST_MASKED_SOFIRQED_Pos 0UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_SOFIRQED_Msk 0x1UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_DIRQED_Pos 1UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_DIRQED_Msk 0x2UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_CNNIRQED_Pos 2UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_CNNIRQED_Msk 0x4UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_CMPIRQED_Pos 3UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_CMPIRQED_Msk 0x8UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_URIRQED_Pos 4UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_URIRQED_Msk 0x10UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_RWKIRQED_Pos 5UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_RWKIRQED_Msk 0x20UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_RESERVED_6_Pos 6UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_RESERVED_6_Msk 0x40UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_TCANED_Pos 7UL
#define USBFS_USBHOST_INTR_USBHOST_MASKED_TCANED_Msk 0x80UL
/* USBFS_USBHOST.INTR_HOST_EP */
#define USBFS_USBHOST_INTR_HOST_EP_EP1DRQ_Pos   2UL
#define USBFS_USBHOST_INTR_HOST_EP_EP1DRQ_Msk   0x4UL
#define USBFS_USBHOST_INTR_HOST_EP_EP1SPK_Pos   3UL
#define USBFS_USBHOST_INTR_HOST_EP_EP1SPK_Msk   0x8UL
#define USBFS_USBHOST_INTR_HOST_EP_EP2DRQ_Pos   4UL
#define USBFS_USBHOST_INTR_HOST_EP_EP2DRQ_Msk   0x10UL
#define USBFS_USBHOST_INTR_HOST_EP_EP2SPK_Pos   5UL
#define USBFS_USBHOST_INTR_HOST_EP_EP2SPK_Msk   0x20UL
/* USBFS_USBHOST.INTR_HOST_EP_SET */
#define USBFS_USBHOST_INTR_HOST_EP_SET_EP1DRQS_Pos 2UL
#define USBFS_USBHOST_INTR_HOST_EP_SET_EP1DRQS_Msk 0x4UL
#define USBFS_USBHOST_INTR_HOST_EP_SET_EP1SPKS_Pos 3UL
#define USBFS_USBHOST_INTR_HOST_EP_SET_EP1SPKS_Msk 0x8UL
#define USBFS_USBHOST_INTR_HOST_EP_SET_EP2DRQS_Pos 4UL
#define USBFS_USBHOST_INTR_HOST_EP_SET_EP2DRQS_Msk 0x10UL
#define USBFS_USBHOST_INTR_HOST_EP_SET_EP2SPKS_Pos 5UL
#define USBFS_USBHOST_INTR_HOST_EP_SET_EP2SPKS_Msk 0x20UL
/* USBFS_USBHOST.INTR_HOST_EP_MASK */
#define USBFS_USBHOST_INTR_HOST_EP_MASK_EP1DRQM_Pos 2UL
#define USBFS_USBHOST_INTR_HOST_EP_MASK_EP1DRQM_Msk 0x4UL
#define USBFS_USBHOST_INTR_HOST_EP_MASK_EP1SPKM_Pos 3UL
#define USBFS_USBHOST_INTR_HOST_EP_MASK_EP1SPKM_Msk 0x8UL
#define USBFS_USBHOST_INTR_HOST_EP_MASK_EP2DRQM_Pos 4UL
#define USBFS_USBHOST_INTR_HOST_EP_MASK_EP2DRQM_Msk 0x10UL
#define USBFS_USBHOST_INTR_HOST_EP_MASK_EP2SPKM_Pos 5UL
#define USBFS_USBHOST_INTR_HOST_EP_MASK_EP2SPKM_Msk 0x20UL
/* USBFS_USBHOST.INTR_HOST_EP_MASKED */
#define USBFS_USBHOST_INTR_HOST_EP_MASKED_EP1DRQED_Pos 2UL
#define USBFS_USBHOST_INTR_HOST_EP_MASKED_EP1DRQED_Msk 0x4UL
#define USBFS_USBHOST_INTR_HOST_EP_MASKED_EP1SPKED_Pos 3UL
#define USBFS_USBHOST_INTR_HOST_EP_MASKED_EP1SPKED_Msk 0x8UL
#define USBFS_USBHOST_INTR_HOST_EP_MASKED_EP2DRQED_Pos 4UL
#define USBFS_USBHOST_INTR_HOST_EP_MASKED_EP2DRQED_Msk 0x10UL
#define USBFS_USBHOST_INTR_HOST_EP_MASKED_EP2SPKED_Pos 5UL
#define USBFS_USBHOST_INTR_HOST_EP_MASKED_EP2SPKED_Msk 0x20UL
/* USBFS_USBHOST.HOST_DMA_ENBL */
#define USBFS_USBHOST_HOST_DMA_ENBL_DM_EP1DRQE_Pos 2UL
#define USBFS_USBHOST_HOST_DMA_ENBL_DM_EP1DRQE_Msk 0x4UL
#define USBFS_USBHOST_HOST_DMA_ENBL_DM_EP2DRQE_Pos 3UL
#define USBFS_USBHOST_HOST_DMA_ENBL_DM_EP2DRQE_Msk 0x8UL
/* USBFS_USBHOST.HOST_EP1_BLK */
#define USBFS_USBHOST_HOST_EP1_BLK_BLK_NUM_Pos  16UL
#define USBFS_USBHOST_HOST_EP1_BLK_BLK_NUM_Msk  0xFFFF0000UL
/* USBFS_USBHOST.HOST_EP2_BLK */
#define USBFS_USBHOST_HOST_EP2_BLK_BLK_NUM_Pos  16UL
#define USBFS_USBHOST_HOST_EP2_BLK_BLK_NUM_Msk  0xFFFF0000UL


#endif /* _CYIP_USBFS_H_ */


/* [] END OF FILE */
